/**
 * Created by wengyian on 2018/1/31.
 */
module.exports = {
  // 网络错误提示信息
  CODEMESSAGE: {
    400: '发出的请求有错误，服务器没有进行新建或修改数据的操作。',
    401: '用户没有权限（令牌、用户名、密码错误）。',
    403: '用户得到授权，但是访问是被禁止的。',
    404: '发出的请求针对的是不存在的记录，服务器没有进行操作。',
    405: '方法不被允许。',
    406: '请求的格式不可得。',
    410: '请求的资源被永久删除，且不会再得到的。',
    422: '当创建一个对象时，发生一个验证错误。',
    500: '服务器发生错误，请检查服务器。',
    502: '网关错误。',
    503: '服务不可用，服务器暂时过载或维护。',
    504: '网关超时。',
  },
  // 身份证件类型
  IDENTITY_CARD_TYPE: {
    110001: '博士研究生毕业',
    110002: '居民身份证',
    110003: '外国护照',
    110004: '港澳居民来往内地通行证',
    110005: '台湾居民来往大陆通行证',
    110006: '香港永久性居民身份证',
    110007: '台湾身份证',
    110008: '澳门特别行政区永久性居民身份证',
    110009: '外国人身份证件',
    110010: '其他个人证件',
  },
  // 机构类别
  ORG_TYPE: {
    11601: '税务师事务所',
    11602: '会计师事务所',
    11603: '律师事务所',
    11604: '代理记账机构',
    11605: '税务代理公司',
    11606: '财税类咨询公司',
    '99': '涉税专业服务人员'
  },
  // 菜单显示专用
  ORGTYPE: {
    11601: '税务师事务所',
    11602: '会计师事务所',
    11603: '律师事务所',
    11604: '代理记账机构',
    11605: '税务代理公司',
    11606: '财税类咨询公司',
    11699: '涉税专业服务人员'
  },
  // 执行许可证类别
  LICENSE_CATEGORY: {
    117001: '税务师事务所行政登记证',
    117002: '会计师事务所执业证书',
    117003: '律师事务所执业许可证',
    117004: '代理记账许可证书',
  },
  // 用户角色
  USER_ROLE: {
    5: '超级管理员',
    6: '税务机构',
    7: '税务代理人',
    8: '委托人',
  },
  // 商品状态
  PRODUCT_STATUS: {
    1: '未发布',
    2: '已发布',
    3: '已下架',
    4: '已删除',
  },
  // 财务报表报送状态
  FINCIAL_STATUS: {
    0: '未导入',
    1: '已导入',
    2: '已报送',
    3: '报送失败'
  },
  // 协议服务项目类型
  PROTOCOL_TYPE: {
    '000000': '全部',
    '030000': '专业税务顾问',
    '040000': '税收策划',
    '050000': '涉税鉴证',
    '060000': '纳税情况审查'
  },
  // 业务内容
  PROJECT_CONTENT: {
    '050000': '涉税鉴证',
    '050100': '企业所得税汇算清缴纳税申报鉴证业务',
    '050200': '企业税前弥补亏损鉴证业务',
    '050300': '企业资产损失税前扣除鉴证业务',
    '050400': '土地增值税清算鉴证业务',
    '050500': '高新技术企业认定鉴证业务',
    '050600': '企业注销税务登记税款清算鉴证业务',
    '050700': '研发费用加计扣除鉴证业务',
    '059900': '其他涉税鉴证'
  },
  // 业务内容
  PROJECT_CON: {
    '050100': '企业所得税汇算清缴纳税申报鉴证业务',
    '050200': '企业税前弥补亏损鉴证业务',
    '050300': '企业资产损失税前扣除鉴证业务',
    '050400': '土地增值税清算鉴证业务',
    '050500': '高新技术企业认定鉴证业务',
    '050600': '企业注销税务登记税款清算鉴证业务',
    '050700': '研发费用加计扣除鉴证业务',
    '059900': '其他涉税鉴证'
  },
  // 状态异常
  STATUS_DATA: {
    0: '请求异常',
    1: '数据异常',
    2: '网络异常',
    3: '无数据'
  },
  // 服务项目
  SERVER_CONTENT: {
    1: '一、纳税申报代理',
    2: '二、一般税务咨询',
    3: '三、专业税务顾问',
    4: '四、税收策划',
    5: '五、税收鉴证',
    7: '(1)企业所得税汇算清缴纳税申报鉴证业务',
    8: '(2)企业税前弥补亏损鉴证业务',
    9: '(3)企业资产损失税前扣除鉴证业务',
    10: '(4)土地增值税清算鉴证业务',
    12: '(5)高新技术企业认定鉴证业务',
    13: '(6)企业注销税务登记税款清算鉴证业务',
    14: '(7)研发费加计扣除鉴证业务',
    15: '(8)其他',
    16: '六、纳税情况审查',
    17: '七、其他税务事项代理',
    18: '八、其他涉税服务'
  },
  // 企业会计制度
  COMPANYACCOUNT_TYPE: {
    'ZL1001001': '企业会计准则(一般企业)',
    'ZL1001002': '企业会计制度',
    'ZL1001003': '小企业会计准则'
  },
  // 会计表格类型
  ACCOUNTTABLE_TYPE: {
    1: '资产负债表',
    2: '利润表'
  },
  // 表格标题
  ACCOUNTTABLE_TITLE: {
    'ZL1001001': '适用于执行企业会计准则的一般企业',
    'ZL1001002': '适用于执行企业会计制度的企业',
    'ZL1001003': '适用于执行小企业会计准则的企业'
  },
  // 涉税业务类型
  TAXRELATED_TYPE: {
    '030000': '专业税务顾问',
    '040000': '税收策划',
    '050000': '涉税鉴证',
    '060000': '纳税情况审查'
  },
  // 鉴证结论类型
  FORENSICCONCLUSION_TYPE: {
    1: '无保留意见的鉴证业务报告',
    2: '保留意见的鉴证业务报告',
    3: '无法表明意见的鉴证业务报告',
    4: '否定意见的鉴证业务报告'
  },
  // 税务类型
  TAX_TYPE: {
    '118001': '法定代表人',
    '118002': '执行事务合伙人',
    '': '涉税专业服务人员'
  },
  // 所得税征收方式
  INCOMETAXCOLLECTION_TYPE: {
    '1': '查账征收',
    '2': '核定征收'
  },
  // 增值申报表格类型
  VTADECLARETABLE_TYPE: {
    '1': '增值税纳税申报表(小规模纳税人适用)',
    '2': '增值税纳税申报表(小规模纳税人适用)附列资料',
    '3': '增值税减免税申报明细表'
  },
  // 小规模纳税
  Modify_CONTENT: {
    jsyj_Arr: [
      '（一）应征增值税不含税销售额（3%征收率）',
      '税务机关代开的增值税专用发票不含税销售额',
      '税控器具开具的普通发票不含税销售额',
      '（二）应征增值税不含税销售额（5%征收率）',
      '税务机关代开的增值税专用发票不含税销售额',
      '税控器具开具的普通发票不含税销售额',
      '（三）销售使用过的固定资产不含税销售额',
      '税控器具开具的普通发票不含税销售额',
      '（四）免税销售额',
      '小微企业免税销售额',
      '未达起征点销售额',
      '其他免税销售额',
      '（五）出口免税销售额',
      '税控器具开具的普通发票销售额',
      '核定销售额',
      '本期应纳税额',
      '核定应纳税额',
      '本期应纳税额减征额',
      '本期免税额',
      '小微企业免税额',
      '微企业免税额',
      '应纳税额合计',
      '本期预缴税额',
      '本期应补（退）税额'
    ],
    lc: ['1', '2', '3', '4', '5', '6',
      '7(7≥8)', '8', '9=10+11+12',
      '10', '11', '12', '13(13≥14)',
      '14', '15', '16', '17', '18',
      '19', '20', '21', '22=16-18或17-18',
      '23(原21)', '24=22-23'
    ]
  },
  // 小规模纳税附列资料
  Modify2_CONTENT: {
    jsyj_Arr: [
      '应税行为（3%征收率）扣除额计算',
      '应税行为（3%征收率）计税销售额计算',
      '应税行为（5%征收率）扣除额计算',
      '应税行为（5%征收率）计税销售额计算'],
    jsjs_Arr: ['期初余额', '本期发生额', '本期扣除额', '期末余额', '全部含税收入（适用3%征收率）',
      '本期扣除额', '含税销售额', '不含税销售额', '期初余额', '本期发生额', '本期扣除额', '期末余额',
      '全部含税收入（适用5%征收率）', '本期扣除额', '含税销售额', '不含税销售额'],
    xgmjs_Arr: ['1', '2', '3（3≤1+2之和，且3≤5）',
      '4=1+2-3', '5', '6=3', '7=5-6', '8=7/1.03',
      '9', '10', '11（11≤9+10之和，且11≤13）', '12=9+10-11', '13', '14=11', '15=13-14', '16=15/1.05']
  }
}
